import 'dart:async';
import 'dart:io';

import 'package:camera/camera.dart';
import 'package:flutter/material.dart';
import 'package:path_provider/path_provider.dart';
import 'package:image_picker_saver/image_picker_saver.dart';
import 'package:simple_permissions/simple_permissions.dart';

List<CameraDescription> cameras;

// 実行されるmain関数
Future<Null> main() async {
  //=========================================
  // P25
  //=========================================
}

// Stateを持たないWidgetオブジェクト
class MyApp extends StatelessWidget {
  //=========================================
  // P27
  //=========================================
}

// Stateを持つWidgetオブジェクト
class MyHomePage extends StatefulWidget {
  //=========================================
  // P29
  //=========================================
}

// StatefulWidgetで管理されるStateオブジェクト
class _MyHomePageState extends State<MyHomePage> {
  //=========================================
  // P31
  //=========================================

  @override
  Widget build(BuildContext context) {
    //=========================================
    // P33
    //=========================================
  }

  // カメラのプレビューWidget
  //=========================================
  // P36
  //=========================================


  // サムネイルWidget
  //=========================================
  // P38
  //=========================================

  // カメラのプレビューWidget
  //=========================================
  // P40
  //=========================================

  // カメラのアイコンWidget
  //=========================================
  // P42
  //=========================================

  // カメラのインアウトを切り替えるトグルWidget
  //=========================================
  // P44
  //=========================================

  // トグルが選択された時に呼ばれるリスナ
  //=========================================
  // P46
  //=========================================

  // カメラアイコンが押された時に呼ばれるリスナ
  //=========================================
  // P48
  //=========================================

  // タイムスタンプを返す関数
  //=========================================
  // P50
  //=========================================

  // カメラで撮影した画像を保存する関数
  //=========================================
  // P52
  //=========================================

}

// カメラのアイコン画像を返す関数
//=========================================
// P54
//=========================================

// 権限のリクエストを行う関数
//=========================================
// P56
//=========================================
